{
    "food": [
        {
            "type": "side",
            "name": "Rice Casserole",
            "quick": true,
            "ingredients": [
                {
                    "name": "Uncle Ben's converted rice",
                    "amt": "1 cup"
                },
                {
                    "name": "Beef consommé",
                    "amt": "1 can"
                },
                {
                    "name": "French onion soup",
                    "amt": "1 can"
                },
                {
                    "name": "Margarine",
                    "amt": "0.75 stick"
                }
            ],
            "directions": [
                "Combine all ingredients in a covered casserole dish.",
                "Bake for one hour."
            ],
            "notes": "Don’t get fancy. Uncle Ben’s is the only rice that works for this. Also, don’t use butter or oil; it has to be margarine. This is the world’s most forgiving recipe. If you overbake it—no problem.  You can refrigerate it or freeze it and reheat."
        },
        {
            "type": "main",
            "name": "Roast Beef",
            "quick": false,
            "ingredients": [
                {
                    "name": "Bone-in rib roast (also called 'semi-boneless",
                    "amt": "1"
                },
                {
                    "name": "Dale's steak sauce",
                    "amt": "To taste"
                },
                {
                    "name": "Garlic powder",
                    "amt": "To taste"
                }
            ],
            "directions": [
                "Preheat the oven to 375.",
                "Season the roast all over with Dales and garlic powder.",
                "Roast for one hour. Turn off the oven and leave the roast in, with the oven door closed, for at least three hours.", 
                "Turn the oven back on to 375 for 40 minutes (35 minutes if it is a small roast).",
                "Slice and serve."
            ],
            "notes": "One rib will serve two people. So—two ribs for four people, and so on. You need to allow at least three hours between cookings, but it can wait all day. Goes well with horseradish sauce (mix prepared horseradish and sour cream—amounts depend on desired flavor). This will yield a lot of fat in the pan. Unlike many meats, the pan drippings from this roast beef are not particularly good. To clean up—either drain off into a can or something you can throw away, or wait until it congeals and dispose of it then. This will also work with a boneless roast, but is better with a bone-in roast because the bone adds a lot of flavor."
        },
        {
            "type": "main",
            "name": "Filet Mignon",
            "quick": false,
            "ingredients": [
                {
                    "name": "Whole beef tenderloin",
                    "amt": "1"
                },
                {
                    "name": "Soy sauce",
                    "amt": "To taste"
                },
                {
                    "name": "Fresh ground pepper",
                    "amt": "To taste"
                },
                {
                    "name": "Lemon",
                    "amt": "To taste"
                }
            ],
            "directions": [
                "Put the tenderloin in a glass pan (pyrex) and pour soy sauce over it. Squeeze the juice of the lemon over it and grind pepper all over. Slice the lemon and lay the slices over the top.",
                "Marinate in the refrigerator most of the day, turning over occasionally and moving the lemon slices to the top.",
                "About an hour before cooking, take the meat out of the refrigerator and bring to room temperature. This is very important. If you don’t do this, you will throw off the cooking time.",
                "Preheat oven to 450.",
                "Drain and discard the marinade and lemons.",
                "Bake at 450 for 30 minutes."
            ],
            "notes": "This is very rare at 20 minutes (which is what the original recipe called for). I usually bake for 30 minutes. Allow ½ pound of meat per person. Remember that filet is all edible (no bone), so you can calculate pretty accurately. Low sodium soy sauce works just as well as regular soy sauce, and is better for you. The average whole tenderloin is 4-5 lbs. If you want to feed a smaller group, you have two choices. You can buy a whole one and freeze part of it for later use. Or you can buy a center cut filet, which is pretty much what it sounds like—the center portion of a whole filet—about 2 lbs. They generally charge more per pound for the center cut, but you don’t wind up with a lot more meat than you need. When I bake this, I move it to a real roasting pan. I don’t bake it in the pyrex. Serve this with horseradish sauce. Mix prepared horseradish and sour cream. Amounts of each depend on taste preference."
        },
        {
            "type": "main",
            "name": "Boeuf Bourgignon",
            "quick": false,
            "ingredients": [
                {
                    "name": "Diced bacon",
                    "amt": "0.25 cup"
                },
                {
                    "name": "Flour",
                    "amt": "0.25 cup"
                },
                {
                    "name": "Paprika",
                    "amt": "1 tsp"
                },
                {
                    "name": "Salt",
                    "amt": "0.5 or 1 tsp"
                },
                {
                    "name": "Lean chuck beef, cubed",
                    "amt": "3 lbs"
                },
                {
                    "name": "Butter",
                    "amt": "6 tbs"
                },
                {
                    "name": "chopped carrots",
                    "amt": "0.33 cups"
                },
                {
                    "name": "Onion, chopped",
                    "amt": "1"
                },
                {
                    "name": "Clove garlic, crushed",
                    "amt": "1"
                },
                {
                    "name": "Thyme",
                    "amt": "0.25 tsp"
                },
                {
                    "name": "Chopped parslet",
                    "amt": "0.25 cups"
                },
                {
                    "name": "Bay leaf",
                    "amt": "1"
                },
                {
                    "name": "Tobasco sauce",
                    "amt": "0.5 tsp"
                },
                {
                    "name": "Beef boullion (ie. canned beef broth)",
                    "amt": "About 2 cups"
                },
                {
                    "name": "Dry red wine",
                    "amt": "1 cup"
                },
                {
                    "name": "Pearl onions (peeled)",
                    "amt": "8"
                },
                {
                    "name": "Small new potatoes, scrubbed",
                    "amt": "8"
                },
                {
                    "name": "Mushrooms",
                    "amt": "0.5 lbs"
                }
            ],
            "directions": [
                "In a large pot (Dutch oven) cook the bacon until crisp and remove and reserve. Leave the bacon grease in the pot.",
                "In a bowl, combine the flour paprika and a little salt. Roll the beef cubes and coat in the flour mixture.",
                "To the bacon grease, add 4 tbs. (or more) of the butter and melt over medium-high heat. Add the beef cubes and brown all over. (It helps to use tongs to turn them.) This takes a long time. Do it in batches and remove to a plate.",
                "Add the chopped carrot, chopped onion and garlic and saute until the onion is limp.",
                "Add the thyme, parsley, bay leaf, tabasco, bacon, bouiloon and wine. Put the meat back in the pot and simmer,. covered for about two hours. Add more bouillon if you need to to keep the meat covered. Stir occasionally.",
                "Add the small onions, carrots and potatoes. Cook until the potatoes are fork tender--up to an hour.",
                "In a small pan, saute the mushrooms in the rest of the butter (or more--mushrooms absorb a lot of butter) and add to the stew and continue cooking until everything is very tender.",
                "Serve over noodles, with a salad or vegetable.",
                "Don't get too hung up on precise measurements. This is a stew."
            ],
            "notes": "Warning--this is the longest cooking dish I make. It takes me up to 6 hours, when all is said and done. That's why I frequently make the short ribs, which take a lot less (about half) the time and effort. Both recipes follow."
        },
        {
            "type": "main",
            "name": "Beef Short Ribs",
            "quick": false,
            "ingredients": [
                {
                    "name": "Beef short ribs (bone-in or boneless--both work)",
                    "amt": "3 lbs"
                },
                {
                    "name": "Carrots, cut into 1/2 inch pieces (I use peeled baby carrots)",
                    "amt": "2"
                },
                {
                    "name": "Pearl onions, peeled ",
                    "amt": "4 oz"
                },
                {
                    "name": "Pancetta",
                    "amt": "2 oz"
                },
                {
                    "name": "Butter",
                    "amt": "2 tbs"
                },
                {
                    "name": "Vegetable oil",
                    "amt": "1 tbs"
                },
                {
                    "name": "Salt",
                    "amt": "To taste"
                },
                {
                    "name": "Fresh ground black pepper",
                    "amt": "To taste"
                },
                {
                    "name": "Red wine",
                    "amt": "0.5 cups"
                },
                {
                    "name": "Beef or chicken broth",
                    "amt": "0.5 cups"
                }
            ],
            "directions": [
                "Add the carrots, onions and pancetta to the pan and saute a few minutes until the onions and carrots begin to brown/caramelize.", 
                "Add the wine and broth and let bubble for a few minutes to allow the alcohol to evaporate.",
                "Put the ribs back in the pan, with the lid slightly askew. Lower the heat to a simmer and simmer for about 2-3 hours, turning every 20 minutes or so, until the ribs are fall-off-the-bone tender.",
                "Drain and discard the fat, but keep the solids (a combination of cooked down carrots and onions and pan drippings) to put over the ribs."   
            ],
            "notes": "Serve with baked potato (or roasted potatoes) and vegetable/salad."
        },
        {
            "type": "main",
            "name": "Roast Chicken (a/k/a Skinny Lemon Chicken)",
            "quick": true,
            "ingredients": [
                {
                    "name": "Whole chicken (high quality)",
                    "amt": "1"
                },
                {
                    "name": "Lemons",
                    "amt": "2"
                },
                {
                    "name": "Salt",
                    "amt": "To taste"
                },
                {
                    "name": "Freshly ground pepper",
                    "amt": "To taste"
                }
            ],
            "directions": [
                "Preheat the oven to 350.",
                "Rinse the chicken thoroughly, removing all extra fat.",
                "Lean it on a plate or in the sink for 10 minutes to drain.",
                "Pat the chicken dry.",
                "Roll the lemons to bring up the juice. You can also microwave them for 30 seconds to help with this. Prick them all over with a fork and put them in the cavity of the chicken.",
                "Seal the opening of the cavity with a toothpick and tie the legs together with twine.",
                "Season the chicken all over with salt and pepper.",
                "Put the chicken in the roasting pan, breast down.",
                "Roast for 35 minutes.",
                "Turn the chicken over (so it is breast up) and roast another 35 minutes.",
                "Raise the oven temperature to 400 and roast for 20 minutes. This will brown it. (It will also spatter a lot.)",
                "Carve and serve."
            ],
            "notes": "Ingredients matter a lot here. A regular chicken will work, but this is much, much better with a really good chicken. I like to use either a kosher chicken (Empire brand) or an organic chicken. The trick is to use a small one—under 4 lbs, and as close to 3 lbs. as you can find. The best lemons are the small skinny ones (hence the name) because they have the most juice. If all you can find are large ones with a thick skin (and not as much juice), you may want to cut them in half to allow as much juice as possible to come out. According to Ms. Hazan, this chicken is supposed to puff up like a balloon, making a fabulous presentation. It has never done that for me, but it always tastes wonderful—puffed or not. Pan juices are fabulous. Spoon them over the meat. I like to serve this with rice pilaf."
        },
        {
            "type": "main",
            "name": "Garlic Chicken with Artichokes and Mushrooms (from Craig Blunden)",
            "quick": false,
            "ingredients": [
                {
                    "name": "Minced garlic",
                    "amt": "8 cloves"
                },
                {
                    "name": "Butter",
                    "amt": "0.75 cups"
                },
                {
                    "name": "Chicken breasts, boned + pounded thin",
                    "amt": "6"
                },
                {
                    "name": "Salt + Pepper",
                    "amt": "To taste"
                },
                {
                    "name": "Olive oil",
                    "amt": "2 tbs"
                },
                {
                    "name": "Mushrooms, sliced",
                    "amt": "0.25 lbs"
                },
                {
                    "name": "Artichoke, canned in brine",
                    "amt": "1 can"
                },
                {
                    "name": "Dry sherry or other white wine",
                    "amt": "2 tbs"
                },
                {
                    "name": "Lemon juice",
                    "amt": "2 tbs"
                }
            ],
            "directions": [
                "Mince 5 cloves of garlic and sauté in ½ cup melted butter.",
                "Add chicken breasts and sprinkle with salt and pepper. Brown and remove to a warm plate.", 
                "Add remaining butter and olive and remaining 3 cloves of garlic. Brown the garlic and toss in the mushrooms.",
                "Add artichokes. Heat. Stir in the lemon juice and the wine.",
                "Let thicken to desired consistency. Stir chicken back in to heat through."
                
            ],
            "notes": "I now use chicken tenderloins, instead of whole breasts. They cook more quickly. (I find that the sliced chicken breasts dry out. Tenderloins seem to work better.) I use about 1 pound. Don’t worry about getting the perfect amount of garlic—more is better. You may want to increase the amount of wine and lemon juice (maybe to ¼ cup each). Just keep them the same amount of each. If you increase these amounts, you may need to take an extra few minutes to reduce them to the right consistency. I like to serve this with rice casserole."
        },        
        {
            "type": "side",
            "name": "Sweet Potato Casserole with Marshmallows (from Mar-Mar, adapted by me)",
            "quick": true,
            "ingredients": [
                {
                    "name": "Sweet potatoes",
                    "amt": "2 lbs"
                },
                {
                    "name": "Sugar",
                    "amt": "0.25 cups"
                },
                {
                    "name": "Butter",
                    "amt": "0.25 cups"
                },
                {
                    "name": "Salt",
                    "amt": "0.5 tsp"
                },
                {
                    "name": "Sour cream",
                    "amt": "1 cup"
                },
                {
                    "name": "Mace",
                    "amt": "0.5 tsp"
                },
                {
                    "name": "Grated nutmet",
                    "amt": "To taste"
                },
                {
                    "name": "Marshmallows",
                    "amt": "Enough"
                }
            ],
            "directions": [
                "Peel sweet potatoes, cut up (halves or quarters) and boil until they are very soft (easily pierced with a fork).",
                "Drain the water and mash them, adding sour cream, sugar, butter, salt and spices.",
                "Turn into a greased baking dish. Top with marshmallows.",
                "Bake, uncovered, at 350 until the marshmallows brown on top."
            ],
            "notes": "Aunt Jane likes to add cinnamon too. I do the mashing/mixing in the stand mixer. You can also use a hand mixer. As you peel the potatoes, put them in the pot of water you’re going to boil them in so they don’t turn brown, which they will if they just sit in the air. You can make this up the day before, bring to room temperature, add marshmallows and bake when you want to serve them. Personally, I think they’re better, though, made the day you serve them."
        },
        {
            "type": "main",
            "name": "Rack of Lamb Encrusted with Parmesan Cheese",
            "quick": false,
            "ingredients": [
                {
                    "name": "Rack of lamb (frenched)",
                    "amt": "2"
                },
                {
                    "name": "Extra virgin olive oil",
                    "amt": "1 tbs"
                },
                {
                    "name": "Salt",
                    "amt": "To taste"
                },
                {
                    "name": "Fresh ground black pepper",
                    "amt": "To taste"
                },
                {
                    "name": "Chopped rosemary",
                    "amt": "2 tsp"
                },
                {
                    "name": "Freshly grated parmesan Reggiano",
                    "amt": "3 tbs"
                },
                {
                    "name": "Plain fine dry breadcrumbs",
                    "amt": "1 tbs"
                }
            ],
            "directions": [
                "Place racks of lamb in baking dish, pour oil over them and spread it over the lamb with your fingers or a basting brush. Season with salt and pepper, then sprinkle with the rosemary.",
                "Put the lamb in the upper level of the preheated oven  and bake for 35 minutes for medium-rare. (Cook it 5 minutes less for rare, and 5 minutes more for medium.)",
                "Mix the parmesan and breadcrumbs on a plate large enough to hold the racks of lamb.",
                "When you have taken the meat out of the oven, raise the temperature to 450.",
                "Grasp one rack of lamb by the ribs with a potholder (or a tongs), place it on the breadcrumb/cheese mixture, and turn to coat all sides. Repeat with the second rack. Put both racks back in the pan (helps to drain off the fat before doing this). Sprinkle any remaining breadcrumb mixture over the lamb. Return pan to oven and bake for 5 more minutes.",
                "Take the lamb out of the oven, cut into chops and serve at once."
            ],
            "notes": "OK. More things to note: this is the original recipe. I used this recipe, but only used one rack of lamb, so I guess I got a lot more crust. If I were going to do two racks, I might double the crust part of the recipe. A rack yields 8-9 chops (or so it seemed). This was enough for two of us, but you might want more if you have a big eater."
        },
        {
            "type": "side",
            "name": "Cranberry relish",
            "quick": true,
            "ingredients": [
                {
                    "name": "Water",
                    "amt": "0.5 cups"
                },
                {
                    "name": "Orange juice",
                    "amt": "0.5 cups"
                },
                {
                    "name": "Sugar",
                    "amt": "0.75 cups"
                },
                {
                    "name": "Fresh cranberries",
                    "amt": "2 cups"
                },
                {
                    "name": "Fresh organe peel, grated",
                    "amt": "To taste"
                }
            ],
            "directions": [
                "Combine water, OJ, and sugar in a large glass (pyrex) casserole).",
                "Cover and bring to a boil in the microwave.",
                "Add berries and grated peel and continue microwaving on high until the berries pop.",
                "Cool and refrigerate."
            ],
            "notes": "This will seem thin when first cooked, but will thicken as it cools. Make sure to use a large, covered casserole. This will boil up (and over!) as it cooks."
        },
        {
            "type": "dessert",
            "name": "Apple crisp",
            "quick": true,
            "ingredients": [
                {
                    "name": "Apples, peeled and sliced (not too thin)",
                    "amt": "8"
                },
                {
                    "name": "Water",
                    "amt": "0.25 cups"
                },
                {
                    "name": "Sugar",
                    "amt": "0.5 cups"
                },
                {
                    "name": "Flour (crust)",
                    "amt": "0.5 cups"
                },
                {
                    "name": "Sugar (crust)",
                    "amt": "0.5 cups"
                },
                {
                    "name": "Graham cracker crumbs (crust)",
                    "amt": "0.5 cups"
                },
                {
                    "name": "Cinnamon (crust)",
                    "amt": "1 tsp"
                },
                {
                    "name": "Melted butter (crust)",
                    "amt": "0.5 cups"
                }
            ],
            "directions": [
                "Preheat oven to 350.",
                "Put apples in baking dish, sprinkle with sugar and water and spread with the crust.",
                "Bake at 350 for one hour."
            ],
            "notes": "Make sure to use cooking apples (for example, Granny Smiths). Red Delicious are lovely, but too soft and too mild for this. Generally I omit the water. The apples get mushy enough without it. About the crust—which is everyone’s favorite part—this is the original recipe. You can double the crust recipe, but sometimes it doesn’t really bake up properly if you do that (the crust doesn’t bake thoroughly.) Mar-Mar uses a deep baking dish so the crust covers the whole top and presses down on the crust to condense it a little. This method seems to work best. As you get used to making this, you can play around with the number of apples you use. It really doesn’t have to be 8. I use enough to mostly fill the baking dish I’m using. Serve with vanilla ice cream."
        },
        {
            "type": "dessert",
            "name": "Blueberry cobbler",
            "quick": true,
            "ingredients": [
                {
                    "name": "Bisquick",
                    "amt": "1 cup"
                },
                {
                    "name": "Sugar",
                    "amt": "0.75 cups"
                },
                {
                    "name": "Butter",
                    "amt": "Some"
                },
                {
                    "name": "Blueberries",
                    "amt": "1 pint"
                }
            ],
            "directions": [
                "Preheat oven to 400.",
                "Put berries in the bottom of a casserole.",
                "Mix Bisquik and the sugar and cover the berries with the mixture.",
                "Dot all over with butter.",
                "Bake at 400 for one hour."
            ],
            "notes": "You can use more berries if you have them. The goal is to cover the top with the Bisquik/ sugar mixture. Don’t skimp on the butter—use a lot. Watch this at the end of the baking time. It can go from done to overdone very quickly. Serve with vanilla ice cream."
        },
        {
            "type": "dessert",
            "name": "Mrs. Edwards Cheesecake (from Babette Edwards, Montgomery, Alabama)",
            "quick": false,
            "ingredients": [
                {
                    "name": "Eggs",
                    "amt": "3"
                },
                {
                    "name": "Sugar",
                    "amt": "1 cup"
                },
                {
                    "name": "Cream cheese (full fat), softened",
                    "amt": "16 oz"
                },
                {
                    "name": "Sour cream (full fat)",
                    "amt": "1.5 pints (3 cups)"
                },
                {
                    "name": "Salt",
                    "amt": "0.5 tsp"
                },
                {
                    "name": "Almond extract",
                    "amt": "1 tsp"
                },
                {
                    "name": "Vanila extract",
                    "amt": "1 tsp"
                },
                {
                    "name": "Graham cracker crust",
                    "amt": "(See step 1 and notes)"
                }
            ],
            "directions": [
                "Preheat oven to 375. Line a springform pan with graham cracker crust. Use the recipe on the box.",
                "Beat the eggs and the salt well.",
                "Add sugar and beat some more.",
                "Add softened cream cheese and sour cream and beat very well.",
                "Add vanilla and almond extract.",
                "Pour mixture into pan and bake one hour at 375.",
                "Let stand at room temperature until cool and then refrigerate. Generally do this—I double the crust recipe and run it up the sides. It usually doesn’t take all of the doubled recipe to do this.",
                "Serve by removing outside ring of springform pan and slicing."
            ],
            "notes": "If you use the recipe from the box of graham crackers, you will get enough crust to line the bottom of the pan. This works OK, but sometimes the top of the cheesecake will crack as it cools. This is a common problem with cheesecakes; it’s just an aesthetic issue. If you make more crust, you can press it up the sides of the pan. This seems to minimize the cracking. I If you run the crust up the side, you will want to run a knife around the inside of the ring of the pan to loosen it from the crust before taking off the outside ring. \n\nThe original recipe called for topping the cheesecake with canned pineapple (drained), but why…?\n\nDad and I first had this cheesecake in Montgomery when we were there for the funeral of his grandmother, Joey Cohen (Mort’s wife, Mar-Mar’s mother) in 1978 (I believe). We asked Mar-Mar to get us the recipe, and Mrs. Edwards has been a legend ever since."
        },
        {
            "type": "dessert",
            "name": "Meringues",
            "quick": false,
            "ingredients": [
                {
                    "name": "Egg whites (room temperature)",
                    "amt": "2"
                },
                {
                    "name": "Salt",
                    "amt": "0.125 tsp (1/8)"
                },
                {
                    "name": "Cream of tartar",
                    "amt": "0.125 tsp (1/8)"
                },
                {
                    "name": "Granulated sugar",
                    "amt": "0.5 cup"
                },
                {
                    "name": "Vanilla",
                    "amt": "0.5 tsp"
                },
                {
                    "name": "Finely chopped walnuts or pecans (optional)",
                    "amt": "0.5 cup"
                }
            ],
            "directions": [
                "Preheat oven to 300.",
                "Combine egg whites salt and cream of tartar in a mixing bowl and beat with an electric mixer until foamy throughout.",
                "Add the sugar two tablespoons at a time, beating after each addition until sugar is blended.",
                "Continue beating until mixture will stand in very stiff peaks.",
                "Fold in vanilla (and nuts, if using).",
                "Spoon mixture onto baking sheets lined with baking parchment.",
                "Bake one hour at 300. Cool and peel off paper carefully."
            ],
            "notes": "This recipe is all about technique. It is very important to have the egg whites at room temperature. If they are too cold, they will not expand with air. I have sometimes microwaved them briefly to warm them. They will expand a fair bit in the first beating, as you incorporate air, and the whole thing will get bigger as you add the sugar.\n\nOnce the sugar is all beaten in, you keep beating for awhile. The mixture will get shiny and will stiffen. It is ready when you can lift up the beaters and it will stand up by itself in stiff peaks.\n\nThese do not spread at all, so you can place them close together on the cookie sheet. \n\nClaiborne’s original recipe is for a pie crust. You line a pie pan with the mixture before baking. Once it is baked, you make a chocolate whipped cream and fill the pie crust with it. Absolutely delicious, but it is hard to get the pie slices out of the pan without the whole thing shattering.\n\nThis is the original recipe. It doesn’t make very much. You can multiply it easily to make more meringues. \n\nThe meringues will last a very long time in an airtight container.\n\nI started making these with my mother (Frances Freedgood) in the 1960s.  My Great Uncle, Sam Flint (Grandma Lilian’s brother-in-law—he was married to her sister Selma (who was originally named Zelda)), was on a low-salt diet. Mom liked to make these for him because they have very little salt. \n\nBrief (and incomplete) family history--Grandma Lilian Cohen (my mother, Fran Freedgood’s, mother) was born a Siegel. She had five sisters (Sadie, Essie, Delsie, Selma (Zelda), and Anne) and one brother (Moe). The one I remember most was Selma Flint. She was closest in age to Grandma Lilian, and we saw them the most. There are lots of Siegel-related family members out there. Unfortunately, we’ve lost contact with most of them."
        },
        {
            "type": "dessert",
            "name": "Pots du Crème au Chocolate (from Bev Lazarus, New Orleans, LA)",
            "quick": false,
            "ingredients": [
                {
                    "name": "Milk",
                    "amt": "Slightly less than 0.75 cup"
                },
                {
                    "name": "Semi sweet chocolate chips",
                    "amt": "1 cup"
                },
                {
                    "name": "Egg",
                    "amt": "1"
                },
                {
                    "name": "Vanilla",
                    "amt": "1 tsp"
                },
                {
                    "name": "Salt",
                    "amt": "1 pinch"
                }
            ],
            "directions": [
                "Place all ingredients, except the milk, in a blender or food processor and mix well.",
                "Heat the milk just to boiling (don’t let it come to a full boil--it should just start to form little bubbles), add to the mixture and blend well.",
                "Pour into little cups (or ramekins) and refrigerate until firm.",
                "This makes 3-4 servings, depending on the size of the cups/ramekins you use."
            ],
            "notes": "This is an old recipe, and the egg is not cooked. I have never had a problem with people getting sick from these (maybe because the milk is so hot), but I suppose it is a possibility. This is easily multiplied. You can adjust the flavor a little by using almond extract. Bev and Spencer Lazarus were old family friends from when Mar-Mar and John lived in New Orleans. They were wonderful surrogate parents when Dad and I went to law school at Tulane. They lived on Octavia Street in New Orleans in the house Spencer grew up in."
        },
        {
            "type": "dessert",
            "name": "Toasted Almond Patfaits (from Mar-Mar)",
            "quick": false,
            "ingredients": [
                {
                    "name": "Almonds - whole, unskinned",
                    "amt": "6 oz"
                },
                {
                    "name": "Vanilla ice cream",
                    "amt": "Some"
                },
                {
                    "name": "Real maple syrup",
                    "amt": "0.75 cups"
                },
                {
                    "name": "Whipped cream",
                    "amt": "To taste"
                }
            ],
            "directions": [
                "Preheat the oven to 400.",
                "Spread almonds on a baking sheet and toast, turning occasionally until they turn dark brown.",
                "Chop nuts fine.",
                "Mix almonds with syrup to make a paste. Add more syrup if it seems too thick.",
                "Spoon generous spoonful of almond paste into the bottom of 6-8 parfait glasses. Cover with a thick layer of ice cream. Continue layering until glasses are full.",
                "Cover with plastic wrap and freeze until hard.",
                "Remove from freezer and top with whipped cream (if desired) and serve."
            ],
            "notes": "It helps to have parfait glasses to make these. I don’t know where you get them now. I suppose you could use any tall  freezer-proof glass. I used to be able to make this recipe using a half-gallon tub of ice cream. Since they have reduced the size of the ice cream tubs, it takes more than one now."
        },
        {
            "type": "dessert",
            "name": "Almond shortbread cookies",
            "quick": false,
            "ingredients": [
                {
                    "name": "Butter, softened",
                    "amt": "2 sticks (1 cup)"
                },
                {
                    "name": "Sugar",
                    "amt": "0.5 cups"
                },
                {
                    "name": "Flour",
                    "amt": "2 cups"
                },
                {
                    "name": "Finely chopped almonds",
                    "amt": "0.5 cups"
                }
            ],
            "directions": [
                "Preheat oven to 350.",
                "Line cookie sheet with baking parchment.",
                "Mix together the butter and sugar. Add the flour and the almonds and blend until smooth.",
                "Roll into small balls and flatten slightly. Put on a cookie sheet  and bake at 350 for 15 minutes or so. The bottoms should just begin to brown.",
                "Cool and sprinkle with powdered sugar."
            ],
            "notes": "The original recipe called for shaping these into crescents before baking.  I find that the ends of the crescents burn before the rest of the cookie is baked, though. When you first add the flour and almonds, the mixture will look crumbly. Keep mixing, and it will come together and become smooth. If you sprinkle the powdered sugar before the cookies are cool, the sugar will sort of congeal."
        },
        {
            "type": "dessert",
            "name": "All-American chocolate chip cookies",
            "quick": false,
            "ingredients": [
                {
                    "name": "Butter",
                    "amt": "2 sticks (1 cup)"
                },
                {
                    "name": "White sugar",
                    "amt": "0.75 cups"
                },
                {
                    "name": "Packed brown sugar",
                    "amt": "0.75 cups"
                },
                {
                    "name": "Egg",
                    "amt": "1"
                },
                {
                    "name": "All-purpose flour",
                    "amt": "2.25 cups"
                },
                {
                    "name": "Baking soda",
                    "amt": "1 tsp"
                },
                {
                    "name": "Salt",
                    "amt": "0.5 tsp"
                },
                {
                    "name": "Semi sweet chocolate chips",
                    "amt": "1.5 or 2 cups"
                }
            ],
            "directions": [
                "Preheat oven to 375.",
                "Line cookie sheets with baking parchment.",
                "Mix together the sugars, butter and egg in a large bowl.",
                "Whisk together the flour, baking soda and salt and mix it into the sugar/butter mixture. Dough will be stiff.",
                "Stir in the chocolate chips.",
                "Drop dough by rounded spoonfuls onto baking sheet—about 2 inches apart.",
                "Bake 8-10 minutes until light brown (centers will be slightly soft).",
                "Cool slightly and remove from cookie sheets to cool completely."
            ],
            "notes": "This is a very good recipe. The other excellent chocolate chip cookie recipe is the Toll House recipe. You can find it on the Nestles chocolate chip package. Packed brown sugar—press the sugar into the measuring cup. I think light or dark brown sugars work equally well. I generally use dark brown."
        },
        {
            "type": "dessert",
            "name": "Grandma B's Molasses Cookies (from Jennifer Mangold)",
            "quick": false,
            "ingredients": [
                {
                    "name": "Shortening (ie. Crisco)",
                    "amt": "0.75 cups"
                },
                {
                    "name": "White sugar",
                    "amt": "1 cup"
                },
                {
                    "name": "Dark molasses (unsulphered—-yellow label in the Grandma’s brand)",
                    "amt": "0.25 cups cups"
                },
                {
                    "name": "Egg",
                    "amt": "1"
                },
                {
                    "name": "All-purpose flour",
                    "amt": "2 cups"
                },
                {
                    "name": "Baking soda",
                    "amt": "2 tsp"
                },
                {
                    "name": "Salt",
                    "amt": "1 tsp"
                },
                {
                    "name": "Ginger",
                    "amt": "1 tsp"
                },
                {
                    "name": "Cinnamon",
                    "amt": "1 tsp"
                }
            ],
            "directions": [
                "Preheat oven to 325.",
                "Mix all ingredients and chill well (several hours or oernight).",
                "Form into 1” balls and roll in extra sugar.",
                "Place on ungreased cookie sheet and bake 8-10 minutes at 325.",
                "Tops will crack as they cool."
            ],
            "notes": "Lining the cookie sheet with baking parchment will make clean-up easier. Crisco makes these light and airy. It now comes in sticks, like butter, so it is easy to measure the right amount without getting all greasy."
        },
        {
            "type": "dessert",
            "name": "Almond biscotti",
            "quick": false,
            "ingredients": [
                {
                    "name": "All-purpose flour",
                    "amt": "2 cups"
                },
                {
                    "name": "White sugar",
                    "amt": "7/8 cup"
                },
                {
                    "name": "Baking soda",
                    "amt": "1 tsp"
                },
                {
                    "name": "Salt",
                    "amt": "1 dash"
                },
                {
                    "name": "Eggs",
                    "amt": "3"
                },
                {
                    "name": "Vanilla",
                    "amt": "1 tsp"
                },
                {
                    "name": "Almond extract",
                    "amt": "0.25 tsp"
                },
                {
                    "name": "Raw almonds",
                    "amt": "0.75 cups"
                }
            ],
            "directions": [
                "Toast the almonds. Spread them on a baking sheet and bake at 350 for 12 minutes. When cool, cut each almond into 2-3 pieces.",
                "Preheat oven to 300.",
                "Line a baking sheet with baking parchment.",
                "Mix dry ingredients together.",
                "Beat eggs with the vanilla and almond extracts.",
                "Mix egg mixture into the dry ingredients. Blend in cut almonds. Batter will be stiff and gloppy.",
                "Divide batter in two and form two logs. Place both logs of batter on baking sheet, leaving room between them to spread.",
                "Bake at 300 for 50 minutes.",
                "Remove from oven. Slice each log into ½ inch slices. Lay the slices on the baking sheet, cut side up. Bake at 300 for 12 minutes. Turn the slices over so the other cut side is up, and bake for another 12 minutes.  Cool on a rack. Biscotti will get hard and crunchy as they cool."
            ],
            "notes": "Batter can be very sticky. You may want to flour your hands to work with it. Keep the slices to ½ inch or less, otherwise the biscotti won’t be crunchy enough."
        }
    ]
}